README.org
#+TITLE: *Iron Brush Tattoo* /Case Jewelry/
#+DATE: Tue May  3 10:45:24 CDT 2016
#+AUTHOR: AnderSon
#+OPTIONS: tags:nil

/Rails 4.2.6/

https://github.com/IronBrushTattoo/cj_rails.git

* Config

** Gemfile

   [[./Gemfile]]

   #+NAME: Gemfile
   #+begin_src ruby :tangle Gemfile :padline no
     source 'https://rubygems.org'

     gem 'rails', '4.2.6'
     gem 'pg', '~> 0.15'
     gem 'sass-rails', '~> 5.0'
     gem 'uglifier', '>= 1.3.0'
     gem 'coffee-rails', '~> 4.1.0'
     gem 'jquery-rails'
     gem 'turbolinks'
     gem 'jbuilder', '~> 2.0'
     gem 'sdoc', '~> 0.4.0', group: :doc
     gem 'dragonfly', '~> 1.0.12'
     gem 'rack-cache', :require => 'rack/cache'
     #gem 'prawn', '~> 2.1'
     gem 'prawn'

     group :development, :test do
       gem 'byebug'
     end

     group :development do
       gem 'web-console', '~> 2.0'
       gem 'spring'
     end
   #+end_src
   
** Gems

   [[Dragonfly]]
   [[Prawn]]

* First steps :rails_template:rails:rake:

  : rake db:migrate
  : rake db:setup
* Project

  The purpose of this application is to produce several pdf files from an xlsx file,
  as a re-implementation of https://github.com/IronBrushTattoo/cj as a web 
  application.

** User Story

   - user logs in ([[Authentication]])
     - users will be piercers
   - chooses xlsx file for upload
     [[File Upload]]
   - selects number of days back to make labels from
   - submits
     - BACKGROUND
       - cj-parser.rb does what it does...
         - [ ] rewrite in rails?
   - downloads sheets(pdf files)

** File Upload

   - possible gems
     https://www.ruby-toolbox.com/categories/rails_file_uploads
     
     - paperclip
       - nb
         - used paperclip before
         - seemed to be designed specifically for image files
         - always worked well
     - carrierwave
       - nb
         - used before, but not thoroughly
           - i kind of remember having issues with it
     - dragonfly
       https://github.com/markevans/dragonfly
       http://markevans.github.io/dragonfly/
       http://markevans.github.io/dragonfly/rails/

       Dragonfly is a highly customizable ruby gem for handling images and other
       attachments and is already in use on thousands of websites

       [[Dragonfly]]

       - nb
         - used briefly before
           - i remember it being an easy configuration
     - attachment fu
       https://github.com/technoweenie/attachment_fu
       
       Treat an ActiveRecord model as a file attachment, storing its patch, size,
       content type, etc. http://weblog.technoweenie.net

       - nb
         - has not been maintained since Apr 25, 2009
     - refile
       - nb
         - was my next choice when previously working with file uploads
     - jquery.fileupload-rails
     - imagery
     - attached
     - papermill
     - fileuploader-rails
     - filecip
     - simple-image-uploader

*** Dragonfly
    
    http://markevans.github.io/dragonfly/rails/

**** Setup
     
     - [X] gem 'dragonfly', '~> 1.0.12'

       - [X] modify [[Gemfile]]

       - [X] bundle install

     - [X] rails g dragonfly

       generates config/initializers/dragonfly.rb

       [[./config/initializers/dragonfly.rb]]

       #+begin_src ruby :tangle config/initializers/dragonfly.rb :padline no
         require 'dragonfly'

         # Configure
         Dragonfly.app.configure do
           plugin :imagemagick

           secret "72245c7371d66ccca6f9356779fa16e3104e6676c1e57af987e9e3f92130dca5"

           url_format "/media/:job/:name"

           datastore :file,
             root_path: Rails.root.join('public/system/dragonfly', Rails.env),
             server_root: Rails.root.join('public')
         end

         # Logger
         Dragonfly.logger = Rails.logger

         # Mount as middleware
         Rails.application.middleware.use Dragonfly::Middleware

         # Add model functionality
         if defined?(ActiveRecord::Base)
           ActiveRecord::Base.extend Dragonfly::Model
           ActiveRecord::Base.extend Dragonfly::Model::Validations
         end
       #+end_src

