README.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Config</a>
<ul>
<li><a href="#sec-1-1">1.1. Gemfile</a></li>
<li><a href="#sec-1-2">1.2. Gems</a></li>
</ul>
</li>
<li><a href="#sec-2">2. First steps</a></li>
<li><a href="#sec-3">3. Project</a>
<ul>
<li><a href="#sec-3-1">3.1. User Story</a></li>
<li><a href="#sec-3-2">3.2. File Upload</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. Dragonfly</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3. File Conversion</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1. xlsx processing</a></li>
<li><a href="#sec-3-3-2">3.3.2. latex processing</a></li>
</ul>
</li>
<li><a href="#sec-3-4">3.4. Authentication</a></li>
<li><a href="#sec-3-5">3.5. Views</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1. Routes</a></li>
<li><a href="#sec-3-5-2">3.5.2. Static Pages</a></li>
</ul>
</li>
<li><a href="#sec-3-6">3.6. Controllers</a>
<ul>
<li><a href="#sec-3-6-1">3.6.1. Pages</a></li>
<li><a href="#sec-3-6-2">3.6.2. Spreadsheets</a></li>
</ul>
</li>
<li><a href="#sec-3-7">3.7. Models</a>
<ul>
<li><a href="#sec-3-7-1">3.7.1. Page</a></li>
<li><a href="#sec-3-7-2">3.7.2. Spreadsheet</a></li>
<li><a href="#sec-3-7-3">3.7.3. Label</a></li>
</ul>
</li>
<li><a href="#sec-3-8">3.8. Classes</a>
<ul>
<li><a href="#sec-3-8-1">3.8.1. SpreadsheetPdf</a></li>
</ul>
</li>
<li><a href="#sec-3-9">3.9. <span class="todo TODO">TODO</span> </a></li>
</ul>
</li>
</ul>
</div>
</div>

*Rails 4.2.6*

<https://github.com/IronBrushTattoo/cj_rails.git>

# Config<a id="sec-1" name="sec-1"></a>

## Gemfile<a id="sec-1-1" name="sec-1-1"></a>

<./Gemfile>

    source 'https://rubygems.org'
    
    gem 'rails', '4.2.6'
    gem 'pg', '~> 0.15'
    gem 'sass-rails', '~> 5.0'
    gem 'uglifier', '>= 1.3.0'
    gem 'coffee-rails', '~> 4.1.0'
    gem 'jquery-rails'
    gem 'turbolinks'
    gem 'jbuilder', '~> 2.0'
    gem 'sdoc', '~> 0.4.0', group: :doc
    gem 'dragonfly', '~> 1.0.12'
    gem 'rack-cache', :require => 'rack/cache'
    #gem 'prawn', '~> 2.1'
    gem 'prawn'
    
    group :development, :test do
      gem 'byebug'
    end
    
    group :development do
      gem 'web-console', '~> 2.0'
      gem 'spring'
    end

## Gems<a id="sec-1-2" name="sec-1-2"></a>

3.2.1
3.3.2.1

# First steps<a id="sec-2" name="sec-2"></a>

    rake db:migrate
    rake db:setup

# Project<a id="sec-3" name="sec-3"></a>

The purpose of this application is to produce several pdf files from an xlsx file,
as a re-implementation of <https://github.com/IronBrushTattoo/cj> as a web 
application.

## User Story<a id="sec-3-1" name="sec-3-1"></a>

-   user logs in (3.4)
    -   users will be piercers
-   chooses xlsx file for upload
    3.2
-   selects number of days back to make labels from
-   submits
    -   BACKGROUND
        -   cj-parser.rb does what it does&#x2026;
            -   [ ] rewrite in rails?
-   downloads sheets(pdf files)

## File Upload<a id="sec-3-2" name="sec-3-2"></a>

-   possible gems
    <https://www.ruby-toolbox.com/categories/rails_file_uploads>
    -   paperclip
        -   nb
            -   used paperclip before
            -   seemed to be designed specifically for image files
            -   always worked well
    -   carrierwave
        -   nb
            -   used before, but not thoroughly
                -   i kind of remember having issues with it
    -   dragonfly
        <https://github.com/markevans/dragonfly>
        <http://markevans.github.io/dragonfly/>
        <http://markevans.github.io/dragonfly/rails/>
        
        Dragonfly is a highly customizable ruby gem for handling images and other
        attachments and is already in use on thousands of websites
        
        3.2.1
        
        -   nb
            -   used briefly before
                -   i remember it being an easy configuration
    -   attachment fu
        <https://github.com/technoweenie/attachment_fu>
        
        Treat an ActiveRecord model as a file attachment, storing its patch, size,
        content type, etc. <http://weblog.technoweenie.net>
        
        -   nb
            -   has not been maintained since Apr 25, 2009
    -   refile
        -   nb
            -   was my next choice when previously working with file uploads
    -   jquery.fileupload-rails
    -   imagery
    -   attached
    -   papermill
    -   fileuploader-rails
    -   filecip
    -   simple-image-uploader

### Dragonfly<a id="sec-3-2-1" name="sec-3-2-1"></a>

<http://markevans.github.io/dragonfly/rails/>

1.  Setup

    -   [X] gem 'dragonfly', '~> 1.0.12'
        -   [X] modify 1
        
        -   [X] bundle install
    
    -   [X] rails g dragonfly
        
        generates config/initializers/dragonfly.rb
        
        <./config/initializers/dragonfly.rb>
        
            require 'dragonfly'
            
            # Configure
            Dragonfly.app.configure do
              plugin :imagemagick
            
              secret "72245c7371d66ccca6f9356779fa16e3104e6676c1e57af987e9e3f92130dca5"
            
              url_format "/media/:job/:name"
            
              datastore :file,
                root_path: Rails.root.join('public/system/dragonfly', Rails.env),
                server_root: Rails.root.join('public')
            end
            
            # Logger
            Dragonfly.logger = Rails.logger
            
            # Mount as middleware
            Rails.application.middleware.use Dragonfly::Middleware
            
            # Add model functionality
            if defined?(ActiveRecord::Base)
              ActiveRecord::Base.extend Dragonfly::Model
              ActiveRecord::Base.extend Dragonfly::Model::Validations
            end
