README.org
****** Creating PDF Using Prawn in Ruby on Rails

       http://www.idyllic-software.com/blog/creating-pdf-using-prawn-in-ruby-on-rails/

       - [X] [[Gemfile]]

         : gem 'prawn'
         : bundle install

       - [X] [[./config/initializers/mime_types.rb]]

         create a PDF Mime::Type inside mime_types.rb

         #+NAME: mime_types.rb
         #+begin_src ruby :tangle config/initializers/mime_types.rb
           # Be sure to restart your server when you modify this file.

           # Add new mime types for use in respond_to blocks:
           # Mime::Type.register "text/richtext", :rtf

           Mime::Type.register "application/pdf", :pdf
         #+end_src

       - [X] [[./app/controllers/spreadsheets_controller.rb]]

         [[Spreadsheets]]
         
         http://www.idyllic-software.com/blog/creating-pdf-using-prawn-in-ruby-on-rails/
         
         : class InvoicesController < ApplicationController
         :
         :   before_filter :authenticate_customer!, :only => [:index, :show]
         :
         :   def index
         :     @invoices = Invoice.all_invoices(current_customer)
         :   end
         :
         :   def show
         :     @invoice = Invoice.find(params[:id])
         :     respond_to do |format|
         :       format.html
         :       format.pdf do
         :         pdf = InvoicePdf.new(@invoice, view_context)
         :         send_data pdf.render, filename: 
         :           "invoice_#{@invoice.created_at.strftime("%d/%m/%Y")}.pdf",
         :           type: "application/pdf"
         :       end
         :     end
         :   end
         : 
         : end

         - [X] open pdf in browser instead of download

           add /disposition: "inline"/ after type

       - [X] create a new class *app/pdfs/spreadsheet_pdf*
         
         [[SpreadsheetPdf]]

         [[Spreadsheets]]

       - [X] restart server

       - [X] [[SpreadsheetPdf]]

         set the /@spreadsheet/ and /view_context/

         : def initialize(spreadsheet, view)
         :   super()
         :   @spreadsheet = spreadsheet
         :   @view = view
         :   text "Spreadsheet #{@spreadsheet.id}"
         : end

       - [ ] create different methods inside [[SpreadsheetPdf]] as per what you want to show on the pdf

         - example

           : def logo
           :   logopath = "#{Rails.root}/app/assets/images/logo.png"
           :   image logopath, :width => 197, :height => 91
           : end
       
******* Issues

        - [ ] NameError (uninitialized constant SpreadsheetsController::SpreadsheetPdf)
      
**** nb
      https://rubygems.org/search?utf8=%E2%9C%93&query=latex
      http://www.sitepoint.com/hackable-pdf-typesetting-in-ruby-with-prawn/
      
      https://github.com/prawnpdf/prawn

      [[Prawn]] is active and looks rad!

      - outdated but possibly useful

        https://github.com/baierjan/rails-latex
        https://github.com/bruce/rtex
   
** Authentication
** Views

*** Routes

    [[./config/routes.rb]]

    #+NAME: routes.rb
    #+begin_src ruby :tangle config/routes.rb :padline no
      Rails.application.routes.draw do
        root 'pages#home'

        resources :spreadsheets

        get "spreadsheets" => "spreadsheets#new"

        # The priority is based upon order of creation: first created -> highest priority.
        # See how all your routes lay out with "rake routes".

        # You can have the root of your site routed with "root"
        # root 'welcome#index'

        # Example of regular route:
        #   get 'products/:id' => 'catalog#view'

        # Example of named route that can be invoked with purchase_url(id: product.id)
        #   get 'products/:id/purchase' => 'catalog#purchase', as: :purchase

        # Example resource route (maps HTTP verbs to controller actions automatically):
        #   resources :products

        # Example resource route with options:
        #   resources :products do
        #     member do
        #       get 'short'
        #       post 'toggle'
        #     end
        #
        #     collection do
        #       get 'sold'
        #     end
        #   end

        # Example resource route with sub-resources:
        #   resources :products do
        #     resources :comments, :sales
        #     resource :seller
        #   end

        # Example resource route with more complex sub-resources:
        #   resources :products do
        #     resources :comments
        #     resources :sales do
        #       get 'recent', on: :collection
        #     end
        #   end

        # Example resource route with concerns:
        #   concern :toggleable do
        #     post 'toggle'
        #   end
        #   resources :posts, concerns: :toggleable
        #   resources :photos, concerns: :toggleable

        # Example resource route within a namespace:
        #   namespace :admin do
        #     # Directs /admin/products/* to Admin::ProductsController
        #     # (app/controllers/admin/products_controller.rb)
        #     resources :products
        #   end
      end
    #+end_src

    [[Custom Endpoints]]

*** Static Pages

    : root 'pages#home'    

    [[Pages]]

**** Home

     [[./app/views/pages/home.html.erb]]

** Controllers

*** Pages

    Static pages controller

    #+begin_src sh
      rails g controller pages --skip-assets
    #+end_src

    #+RESULTS:
    | create | app/controllers/pages_controller.rb       |
    | invoke | erb                                       |
    | create | app/views/pages                           |
    | invoke | test_unit                                 |
    | create | test/controllers/pages_controller_test.rb |
    | invoke | helper                                    |
    | create | app/helpers/pages_helper.rb               |
    | invoke | test_unit                                 |

*** Spreadsheets

** Models

*** Page
*** Spreadsheet

    [[./app/models/spreadsheet.rb]]

    #+NAME: spreadsheet.rb
    #+begin_src ruby :tangle app/models/spreadsheet.rb :padline no
      class Spreadsheet < ActiveRecord::Base
        dragonfly_accessor :file  # defines a reader/writer for file
      end
    #+end_src

*** Label
** Classes

*** SpreadsheetPdf

    : mkdir ./app/pdfs

    [[./app/pdfs/spreadsheet_pdf.rb]]

    #+begin_src ruby :tangle app/pdfs/spreadsheet_pdf.rb :padline no
      class SpreadsheetPdf < Prawn::Document

        def initialize(spreadsheet, view)
          super()
          @spreadsheet = spreadsheet.to_json
          @view = view
          logo
          text "@spreadsheet is of class #{@spreadsheet.class} as #{@spreadsheet}"
        end

        def logo
          logopath = "#{Rails.root}/app/assets/images/logo.png"
          image logopath, :width => 197, :height => 197
        end
        
      end
    #+end_src

    - nb

      [[Prawn]]

** TODO

   - [ ] Tests
   - [ ] sidekiq
     - [ ] background processes for creating pdfs
   - [ ] requirements
     - [ ] roo
     - [ ] chronic
   - [ ] pdflatex

     [[Prawn]]
   - [ ] migrate code from cj-parser
   - [ ] user authentication
   - [ ] file upload
     - [ ] only xlsx file?
     - [ ] AWS
   - [ ] file storage
     - [ ] archival api?
   - [ ] production
     - [ ] heroku
       - [ ] secrets

