README.md
        
            <http://www.idyllic-software.com/blog/creating-pdf-using-prawn-in-ruby-on-rails/>
            
            -   [X] 1
                
                    gem 'prawn'
                    bundle install
            
            -   [X] <./config/initializers/mime_types.rb>
                
                create a PDF Mime::Type inside mime<sub>types</sub>.rb
                
                    # Be sure to restart your server when you modify this file.
                    
                    # Add new mime types for use in respond_to blocks:
                    # Mime::Type.register "text/richtext", :rtf
                    
                    Mime::Type.register "application/pdf", :pdf
            
            -   [X] <./app/controllers/spreadsheets_controller.rb>
                
                3.6.2
                
                <http://www.idyllic-software.com/blog/creating-pdf-using-prawn-in-ruby-on-rails/>
                
                    class InvoicesController < ApplicationController
                    
                      before_filter :authenticate_customer!, :only => [:index, :show]
                    
                      def index
                        @invoices = Invoice.all_invoices(current_customer)
                      end
                    
                      def show
                        @invoice = Invoice.find(params[:id])
                        respond_to do |format|
                          format.html
                          format.pdf do
                            pdf = InvoicePdf.new(@invoice, view_context)
                            send_data pdf.render, filename: 
                              "invoice_#{@invoice.created_at.strftime("%d/%m/%Y")}.pdf",
                              type: "application/pdf"
                          end
                        end
                      end
                    
                    end
                
                -   [X] open pdf in browser instead of download
                    
                    add /disposition: "inline"/ after type
            
            -   [X] create a new class **app/pdfs/spreadsheet<sub>pdf</sub>**
                
                3.8.1
                
                3.6.2
            
            -   [X] restart server
            
            -   [X] 3.8.1
                
                set the *@spreadsheet* and *view<sub>context</sub>*
                
                    def initialize(spreadsheet, view)
                      super()
                      @spreadsheet = spreadsheet
                      @view = view
                      text "Spreadsheet #{@spreadsheet.id}"
                    end
            
            -   [ ] create different methods inside 3.8.1 as per what you want to show on the pdf
                -   example
                    
                        def logo
                          logopath = "#{Rails.root}/app/assets/images/logo.png"
                          image logopath, :width => 197, :height => 91
                        end
            
            1.  Issues
            
                -   [ ] NameError (uninitialized constant SpreadsheetsController::SpreadsheetPdf)

2.  nb

    <https://rubygems.org/search?utf8=%E2%9C%93&query=latex>
    <http://www.sitepoint.com/hackable-pdf-typesetting-in-ruby-with-prawn/>
    
    <https://github.com/prawnpdf/prawn>
    
    3.3.2.1 is active and looks rad!
    
    -   outdated but possibly useful
        
        <https://github.com/baierjan/rails-latex>
        <https://github.com/bruce/rtex>

## Authentication<a id="sec-3-4" name="sec-3-4"></a>

## Views<a id="sec-3-5" name="sec-3-5"></a>

### Routes<a id="sec-3-5-1" name="sec-3-5-1"></a>

<./config/routes.rb>

    Rails.application.routes.draw do
      root 'pages#home'
    
      resources :spreadsheets
    
      get "spreadsheets" => "spreadsheets#new"
    
      # The priority is based upon order of creation: first created -> highest priority.
      # See how all your routes lay out with "rake routes".
    
      # You can have the root of your site routed with "root"
      # root 'welcome#index'
    
      # Example of regular route:
      #   get 'products/:id' => 'catalog#view'
    
      # Example of named route that can be invoked with purchase_url(id: product.id)
      #   get 'products/:id/purchase' => 'catalog#purchase', as: :purchase
    
      # Example resource route (maps HTTP verbs to controller actions automatically):
      #   resources :products
    
      # Example resource route with options:
      #   resources :products do
      #     member do
      #       get 'short'
      #       post 'toggle'
      #     end
      #
      #     collection do
      #       get 'sold'
      #     end
      #   end
    
      # Example resource route with sub-resources:
      #   resources :products do
      #     resources :comments, :sales
      #     resource :seller
      #   end
    
      # Example resource route with more complex sub-resources:
      #   resources :products do
      #     resources :comments
      #     resources :sales do
      #       get 'recent', on: :collection
      #     end
      #   end
    
      # Example resource route with concerns:
      #   concern :toggleable do
      #     post 'toggle'
      #   end
      #   resources :posts, concerns: :toggleable
      #   resources :photos, concerns: :toggleable
    
      # Example resource route within a namespace:
      #   namespace :admin do
      #     # Directs /admin/products/* to Admin::ProductsController
      #     # (app/controllers/admin/products_controller.rb)
      #     resources :products
      #   end
    end

3.2.1.4

### Static Pages<a id="sec-3-5-2" name="sec-3-5-2"></a>

    root 'pages#home'

3.6.1

1.  Home

    <./app/views/pages/home.html.erb>

## Controllers<a id="sec-3-6" name="sec-3-6"></a>

### Pages<a id="sec-3-6-1" name="sec-3-6-1"></a>

Static pages controller

    rails g controller pages --skip-assets

### Spreadsheets<a id="sec-3-6-2" name="sec-3-6-2"></a>

## Models<a id="sec-3-7" name="sec-3-7"></a>

### Page<a id="sec-3-7-1" name="sec-3-7-1"></a>

### Spreadsheet<a id="sec-3-7-2" name="sec-3-7-2"></a>

<./app/models/spreadsheet.rb>

    class Spreadsheet < ActiveRecord::Base
      dragonfly_accessor :file  # defines a reader/writer for file
    end

### Label<a id="sec-3-7-3" name="sec-3-7-3"></a>

## Classes<a id="sec-3-8" name="sec-3-8"></a>

### SpreadsheetPdf<a id="sec-3-8-1" name="sec-3-8-1"></a>

    mkdir ./app/pdfs

<./app/pdfs/spreadsheet_pdf.rb>

    class SpreadsheetPdf < Prawn::Document
    
      def initialize(spreadsheet, view)
        super()
        @spreadsheet = spreadsheet.to_json
        @view = view
        logo
        text "@spreadsheet is of class #{@spreadsheet.class} as #{@spreadsheet}"
      end
    
      def logo
        logopath = "#{Rails.root}/app/assets/images/logo.png"
        image logopath, :width => 197, :height => 197
      end
    
    end

-   nb
    
    3.3.2.1

## TODO <a id="sec-3-9" name="sec-3-9"></a>

-   [ ] Tests
-   [ ] sidekiq
    -   [ ] background processes for creating pdfs
-   [ ] requirements
    -   [ ] roo
    -   [ ] chronic
-   [ ] pdflatex
    
    3.3.2.1
-   [ ] migrate code from cj-parser
-   [ ] user authentication
-   [ ] file upload
    -   [ ] only xlsx file?
    -   [ ] AWS
-   [ ] file storage
    -   [ ] archival api?
-   [ ] production
    -   [ ] heroku
        -   [ ] secrets
